import streamlit as st 

st.set_page_config(
page_title = 'info',)

st.markdown("<h2><u>ΙΚΑΝΟΤΙΚΟΣ ΣΧΕΔΙΑΣΜΟΣ ΣΕ ΔΙΑΤΜΗΣΗ</u></h2>", unsafe_allow_html=True)
  
st.subheader("**Δοκός**")
st.write('**Ροπές**')
st.write("Σύμφωνα με την **_§5.4.2.2_** του Ευρωκώδικα 8, ο υπολογισμός των **τεμνουσών σχεδιασμού** γίνεται με βάση την ισορροπία της δοκού υπό:")
sticky_note_style = """
     background-color: #F0E68C;
     border: 2px solid #9ACD32;
     border-radius: 10px;
     padding: 15px;
     box-shadow: 2px 2px 5px grey;
     width: 300px;
     height: 250px;
 """
st.write('<div style="{}">α) Το εγκάρσιο (κατακόρυφο) φορτίο που δρα επί της δοκού στην σεισµική κατάσταση σχεδιασµού και β) Τις ροπές άκρων Mi,d που αντιστοιχούν σε σχηµατισµό πλαστικών αρθρώσεων για θετικές και αρνητικές διευθύνσεις σεισµικής φόρτισης (µε i=1,2 συµβολίζονται οι ακραίες διατοµές της δοκού).</div>'.format(sticky_note_style), unsafe_allow_html=True)

st.write("")
st.markdown(r'''
 Οι **ροπές των άκρων** υπολογίζονται από τον τύπο:
  $$M_{i,d} = \gamma_{Rd} M_{Rb,i} \min\left(1, \frac{\sum M_{Rc}}{\sum M_{Rb}}\right)$$

  όπου:
 ''')
tab1, tab2, tab3, tab4 = st.tabs(['**_γRd_**', '**_MRb,i_**', '**_∑MRc_**', '**_∑MRb_**'])
with tab1:
  st.write('_Ο συντελεστής που εκφράζει την πιθανή υπεραντοχή λόγω σκλήρυνσης υπό παραµόρφωση του χάλυβα, και εξαρτάται από το είδος της κατασκευής._')
with tab2:
  st.write('_Η τιµή σχεδιασµού της ροπής αντοχής στο άκρο i στην φορά της σεισµικής ροπής κάµψεως που αντιστοιχεί στην εξεταζόµενη φορά της σεισµικής δράσης._')
with tab3:
  st.write('_Το άθροισµα των τιµών σχεδιασµού των ροπών αντοχής των υποστυλωµάτων που συνδέονται µονολιθικά στον κόµβο._')
  css = """
       .colorful-frame {
            border: 2px solid #C71585; /* Border color */
            padding: 10px; /* Padding around the content */
            border-radius: 10px; /* Border radius to make corners round*/
            background-color: #FFFAFA; /* Background color of the frame */
        }
    """
  st.markdown(f'<style>{css}</style>', unsafe_allow_html=True)
  st.markdown('<div class="colorful-frame">Η τιµή του ∑MRc πρέπει να αντιστοιχεί στην αξονική δύναµη ή δυνάµεις του υποστυλώµατος στην σεισµική κατάσταση σχεδιασµού για την εξεταζόµενη φορά της σεισµικής δράσης.</div>', unsafe_allow_html=True)
  st.write("")
  if st.button('* §4.4.2.3'):
    st.write('**→ Σε πολυώροφα κτίρια ο σχηµατισµός πλαστικού µηχανισµού µαλακού ορόφου θα πρέπει να αποφεύγεται λόγω υπερβολικών τοπικών απαιτήσεων πλαστιµότητας στα υποστυλώµατα του µαλακού ορόφου.**')
    st.write('**→ Για την ικανοποίηση της απαίτησης,σε κτίρια πλαισιωτού συστήµατος, περιλαµβανοµένων και κτιρίων µε σύστηµα τοιχωµάτων ισοδύναµο προς πλαισιωτό, η ακόλουθη συνθήκη πρέπει να ικανοποιείται σε όλους τους κόµβους µεταξύ βασικών ή δευτερευουσών σεισµικών δοκών και βασικών σεισµικών υποστυλωµάτων:**')
    st.markdown(r'''
       $$\sum M_{Rc} \geq 1.3 \sum M_{Rb}$$
       ''')
    st.info('Η αυστηρή ερµηνεία της συνθήκης απαιτεί τον υπολογισµό των ροπών στο κέντρο του κόµβου. Οι ροπές αυτές αντιστοιχούν στην ανάπτυξη των τιµών σχεδιασµού των ροπών αντοχής των υποστυλωµάτων ή των δοκών στις εξωτερικές παρειές του κόµβου, καθώς και κατάλληλη πρόβλεψη για τις ροπές που οφείλονται στις τέµνουσες δυνάµεις των παρειών του κόµβου. Εντούτοις, η απώλεια στην ακρίβεια είναι µικρή και η απλοποίηση είναι σηµαντική εάν αγνοηθεί η επίδραση των τεµνουσών. Εποµένως η προσέγγιση αυτή θεωρείται τότε αποδεκτή.', icon="ℹ️️")
with tab4:
  st.write('_Το άθροισµα των τιµών σχεδιασµού των ροπών αντοχής των δοκών που συνδέονται µονολιθικά στον κόµβο._')
  css = """
        .colorful-frame {
            border: 2px solid #C71585; /* Border color */
            padding: 10px; /* Padding around the content */
            border-radius: 10px; /* Border radius to make corners round*/
             background-color: #FFFAFA; /* Background color of the frame */
        }
    """
  st.markdown(f'<style>{css}</style>', unsafe_allow_html=True)
  st.markdown('<div class="colorful-frame"> Όταν χρησιµοποιούνται συνδέσεις µερικής αντοχής, οι ροπές αντοχής αυτών των συνδέσεων λαµβάνονται υπόψη στον υπολογισµό του ∑MRb.</div>', unsafe_allow_html=True)
  st.write("")
  if st.button('* §4.4.2.3.'):
    st.write('**→ Σε πολυώροφα κτίρια ο σχηµατισµός πλαστικού µηχανισµού µαλακού ορόφου θα πρέπει να αποφεύγεται λόγω υπερβολικών τοπικών απαιτήσεων πλαστιµότητας στα υποστυλώµατα του µαλακού ορόφου.**')
    st.write('**→ Για την ικανοποίηση της απαίτησης,σε κτίρια πλαισιωτού συστήµατος, περιλαµβανοµένων και κτιρίων µε σύστηµα τοιχωµάτων ισοδύναµο προς πλαισιωτό, η ακόλουθη συνθήκη πρέπει να ικανοποιείται σε όλους τους κόµβους µεταξύ βασικών ή δευτερευουσών σεισµικών δοκών και βασικών σεισµικών υποστυλωµάτων:**')
    st.markdown(r'''
     $$\sum M_{Rc} \geq 1.3 \sum M_{Rb}$$
     ''')
    st.info('Η αυστηρή ερµηνεία της συνθήκης απαιτεί τον υπολογισµό των ροπών στο κέντρο του κόµβου. Οι ροπές αυτές αντιστοιχούν στην ανάπτυξη των τιµών σχεδιασµού των ροπών αντοχής των υποστυλωµάτων ή των δοκών στις εξωτερικές παρειές του κόµβου, καθώς και κατάλληλη πρόβλεψη για τις ροπές που οφείλονται στις τέµνουσες δυνάµεις των παρειών του κόµβου. Εντούτοις, η απώλεια στην ακρίβεια είναι µικρή και η απλοποίηση είναι σηµαντική εάν αγνοηθεί η επίδραση των τεµνουσών. Εποµένως η προσέγγιση αυτή θεωρείται τότε αποδεκτή.', icon="ℹ️️")

st.write("**Τέμνουσες**")
st.write("Για να απλοποιήσουμε τον **γενικό τύπο για τις τέμνουσες σχεδιασμού των δοκών** θα πρέπει να ελέγξουμε το κλάσμα των αθροισμάτων.")

sticky_note_style = """
           background-color: #F0E68C;
           border: 2px solid #9ACD32;
           border-radius: 10px;
           padding: 15px;
           box-shadow: 2px 2px 5px grey;
           width: 300px;
           height: 300px;
       """

st.write('<div style="{}">Ο υπολογισμός για τις τέμνουσες που προέρχονται από τα κατακόρυφα φορτία γίνεται με τη προϋπόθεση ότι οι πλαστικές αρθρώσεις έχουν σχηματιστεί στα άκρα της δοκού, με αποτέλεσμα η δοκός να θεωρείται αμφίρροπη. Ο υπολογισμός της τέμνουσας Vg+ψ₂q γίνεται με τη βοήθεια του συνδυασμού του κατακόρυφου φορτίου: g + ψ₂q.</div>'.format(sticky_note_style), unsafe_allow_html=True)

st.write("")
st.write("**Τέμνουσς κρίσημων περιοχών**")
st.write("Λόγω του σχηματισμού **πλαστικών αρθρώσεων στα άκρα της δοκού**, υπολογίζονται οι επιπλέον **τέμνουσες σχεδιασμού των κρίσημων περιοχών** καθώς και οι **τέμνουσες ροπών που αντιστοιχούν στα άκρα**.")

st.divider()
st.subheader("**Υποστύλωμα**")
st.write('**Ροπές**')
st.write('Σύμφωνα με την **_§5.4.2.3_** του Ευρωκώδικα 8, ο υπολογισμός των **τεμνουσών σχεδιασμού** γίνεται με βάση την **ισορροπία του υποστυλώματος υπό ροπές άκρων $M_i,d$**, που αντιστοιχολυν σε **σχηματισμό πλαστικών αρθρώσεων** για θετικές και αρνητικές διευθύνσεις της σεισμικής φόρτισης (i = 1,2, οι ακραίες διατομές του υποστυλώματος) ')
st.info('Οι πλαστικές αρθρώσεις θα θεωρούνται ότι σχηματίζονται στα άκρα των δοκών που συνδέονται με τους κόμβους στα άκρα του υποστυλώματος ή στα άκρα των υποστυλωμάτων', icon = "ℹ️️")
st.write("")
st.markdown(r'''
       Οι **ροπές των άκρων** υπολογίζονται από τον τύπο:

       $$M_{i,c} = \gamma_{Rd} \ M_{Rc,i} \min \left(1, \frac{\sum M_{Rb}}{\sum M_{Rc}} \right)$$

       όπου:
       ''')
tab1, tab2, tab3, tab4 = st.tabs(['**_γRd_**', '**_MRc,i_**', '**_∑MRc_**', '**_∑MRb_**'])
with tab1:
  st.write('_Ο συντελεστής που εκφράζει την πιθανή υπεραντοχή λόγω σκλήρυνσης υπό παραµόρφωση του χάλυβα, και εξαρτάται από το είδος της κατασκευής._')
with tab2:
  st.write('_Η τιµή σχεδιασµού της ροπής αντοχής στο άκρο i στην φορά της σεισµικής ροπής κάµψεως που αντιστοιχεί στην εξεταζόµενη φορά της σεισµικής δράσης._')
with tab3:
  st.write('_Το άθροισµα των τιµών σχεδιασµού των ροπών αντοχής των υποστυλωµάτων που συνδέονται µονολιθικά στον κόµβο._')
  css = """
              .colorful-frame {
                  border: 2px solid #C71585; /* Border color */
                  padding: 10px; /* Padding around the content */
                  border-radius: 10px; /* Border radius to make corners round*/
                   background-color: #FFFAFA; /* Background color of the frame */
              }
          """
  st.markdown(f'<style>{css}</style>', unsafe_allow_html=True)
  st.markdown('<div class="colorful-frame">Η τιµή του ∑MRc πρέπει να αντιστοιχεί στην αξονική δύναµη ή δυνάµεις του υποστυλώµατος στην σεισµική κατάσταση σχεδιασµού για την εξεταζόµενη φορά της σεισµικής δράσης.</div>', unsafe_allow_html=True)
  st.write("")
  if st.button('* §4.4.2.3..'):
    st.write('**→ Σε πολυώροφα κτίρια ο σχηµατισµός πλαστικού µηχανισµού µαλακού ορόφου θα πρέπει να αποφεύγεται λόγω υπερβολικών τοπικών απαιτήσεων πλαστιµότητας στα υποστυλώµατα του µαλακού ορόφου.**')
    st.write('**→ Για την ικανοποίηση της απαίτησης,σε κτίρια πλαισιωτού συστήµατος, περιλαµβανοµένων και κτιρίων µε σύστηµα τοιχωµάτων ισοδύναµο προς πλαισιωτό, η ακόλουθη συνθήκη πρέπει να ικανοποιείται σε όλους τους κόµβους µεταξύ βασικών ή δευτερευουσών σεισµικών δοκών και βασικών σεισµικών υποστυλωµάτων:**')
    st.markdown(r'''
           $$\sum M_{Rc} \geq 1.3 \sum M_{Rb}$$
           ''')
    st.info('Η αυστηρή ερµηνεία της συνθήκης απαιτεί τον υπολογισµό των ροπών στο κέντρο του κόµβου. Οι ροπές αυτές αντιστοιχούν στην ανάπτυξη των τιµών σχεδιασµού των ροπών αντοχής των υποστυλωµάτων ή των δοκών στις εξωτερικές παρειές του κόµβου, καθώς και κατάλληλη πρόβλεψη για τις ροπές που οφείλονται στις τέµνουσες δυνάµεις των παρειών του κόµβου. Εντούτοις, η απώλεια στην ακρίβεια είναι µικρή και η απλοποίηση είναι σηµαντική εάν αγνοηθεί η επίδραση των τεµνουσών. Εποµένως η προσέγγιση αυτή θεωρείται τότε αποδεκτή.', icon="ℹ️️")
with tab4:
  st.write('_Το άθροισµα των τιµών σχεδιασµού των ροπών αντοχής των δοκών που συνδέονται µονολιθικά στον κόµβο._')
  css = """
            .colorful-frame {
                border: 2px solid #C71585; /* Border color */
                padding: 10px; /* Padding around the content */
                border-radius: 10px; /* Border radius to make corners round*/
                 background-color: #FFFAFA; /* Background color of the frame */
            }
        """
  st.markdown(f'<style>{css}</style>', unsafe_allow_html=True)
  st.markdown('<div class="colorful-frame"> Όταν χρησιµοποιούνται συνδέσεις µερικής αντοχής, οι ροπές αντοχής αυτών των συνδέσεων λαµβάνονται υπόψη στον υπολογισµό του ∑MRb.</div>', unsafe_allow_html=True)

st.write("")
st.write("**Τέμνουσες**")
st.write("Για να απλοποιήσουμε τον **γενικό τύπο για τις τέμνουσες σχεδιασμού των υποστυλωμάτων** θα πρέπει να ελέγξουμε το κλάσμα των αθροισμάτων.")
st.write("Οι έλεγχοι είναι δύο:")
tab1, tab2 = st.tabs(['**1η**', '**2η**'])
with tab1:
  st.markdown(r'''
         Το άθροισμα των ροπών αντοχής των δοκών να είναι **μεγαλύτερο ή ίσο** από το άθροισμα των ροπών αντοχής των υποστυλωμάτων.

         $$\sum M_{Rb} \geq \sum M_{Rc}$$

       άρα:

       $$\min \left(1, \frac{\sum M_{Rb}}{\sum M_{Rc}}\right) = 1$$

         ''')

with tab2:
  st.markdown(r'''
         Το άθροισμα των ροπών αντοχής των δοκών να είναι **μικρότερο** από το άθροισμα των ροπών αντοχής των υποστυλωμάτων. 

         $$\sum M_{Rb} < \sum M_{Rc}$$

         άρα:

         $$\min \left(1, \frac{\sum M_{Rb}}{\sum M_{Rc}}\right) = \frac{\sum M_{Rb}}{\sum M_{Rc}}$$

         ''')
  st.write("")
  st.write("**Τέμνουσς κρίσημων περιοχών**")
  st.write("Λόγω του σχηματισμού **πλαστικών αρθρώσεων στα άκρα των δοκών που συνδέονται με τους κόμβους στα άκρα του υποστυλώματος**, υπολογίζονται οι επιπλέον **τέμνουσες σχεδιασμού των κρίσημων περιοχών** καθώς και οι **τέμνουσες ροπών που αντιστοιχούν στα άκρα**.")
tab1, tab2 = st.tabs(['**Τέμνουσες ροπών**', '**Τέμνουσες σχεδιασμού**'])
with tab2:
  st.markdown(r'''             
       $$V_{\text{Ed,max},i} = \frac{{\vec{M}_{1,d} + \vec{M}_{2,d}}}{l_{\text{cl}}}$$

       $$V_{\text{Ed,min},i} = \frac{\overleftarrow{M}_{1,d} + \overleftarrow{M}_{2,d}}{l_{\text{cl}}}$$
       ''')

with tab1:
  st.markdown(r'''
         ▸Για θετικές διευθύνσεις της σεισμικής δράσης:
         $$\Delta V_{\text{Ed,max},i} = \frac{{(\vec{M}_{1,d} + \vec{M}_{2,d})}}{{l_{cl}}}$$

         ▸Για αρνητικές διευθύνσεις της σεισμικής δράσης:
         $$\Delta V_{\text{Ed,min},i} = \frac{\overleftarrow{M_{1,d}} + \overleftarrow{M_{2,d}}}{l_{\text{cl}}}$$
         ''')

st.write("")
st.write("")
st.markdown("<h2><u>ΙΚΑΝΟΤΙΚΟΣ ΣΧΕΔΙΑΣΜΟΣ ΣΕ ΚΟΜΒΟΥΣ</u></h2>", unsafe_allow_html=True)

st.subheader("**Δοκός**")
st.write('**Ροπές**')
st.markdown(r'''
 Οι **ροπές αντοχής των δοκών** λαμβάνονται έτσι ώστε να έχουν πάντα την **ίδια φορά επί του κόμβου**, δηλαδή εάν **η ροπή στο άκρο της μιας δοκού** αντιστοιχεί σε **εφελκυσμό**, τότε **η ροπή στο άλλο άκρο** θα αντιστοιχέι σε **θλίψη**.

 Οι ροπές υπολογίζονται από τον τύπο:

  $$M_{i,d} = \gamma_{Rd} M_{Rb,i} \min\left(1, \frac{\sum M_{Rc}}{\sum M_{Rb}}\right)$$
 ''')
tab1, tab2, tab3, tab4 = st.tabs(['**_γRd_**', '**_MRb,i_**', '**_∑MRc_**', '**_∑MRb_**'])
with tab1:
    st.write('_Ο συντελεστής που εκφράζει την πιθανή υπεραντοχή λόγω σκλήρυνσης υπό παραµόρφωση του χάλυβα, και εξαρτάται από το είδος της κατασκευής._')
with tab2:
    st.write('_Η τιµή σχεδιασµού της ροπής αντοχής στο άκρο i στην φορά της σεισµικής ροπής κάµψεως που αντιστοιχεί στην εξεταζόµενη φορά της σεισµικής δράσης._')
with tab3:
    st.write('_Το άθροισµα των τιµών σχεδιασµού των ροπών αντοχής των υποστυλωµάτων που συνδέονται µονολιθικά στον κόµβο._')
    css = """
        .colorful-frame {
            border: 2px solid #C71585; /* Border color */
            padding: 10px; /* Padding around the content */
            border-radius: 10px; /* Border radius to make corners round*/
             background-color: #FFFAFA; /* Background color of the frame */
        }
    """
    st.markdown(f'<style>{css}</style>', unsafe_allow_html=True)
    st.markdown('<div class="colorful-frame">Η τιµή του ∑MRc πρέπει να αντιστοιχεί στην αξονική δύναµη ή δυνάµεις του υποστυλώµατος στην σεισµική κατάσταση σχεδιασµού για την εξεταζόµενη φορά της σεισµικής δράσης.</div>', unsafe_allow_html=True)
    st.write("")
    if st.button('* §4.4.2..3'):
      st.write('**→ Σε πολυώροφα κτίρια ο σχηµατισµός πλαστικού µηχανισµού µαλακού ορόφου θα πρέπει να αποφεύγεται λόγω υπερβολικών τοπικών απαιτήσεων πλαστιµότητας στα υποστυλώµατα του µαλακού ορόφου.**')
      st.write('**→ Για την ικανοποίηση της απαίτησης,σε κτίρια πλαισιωτού συστήµατος, περιλαµβανοµένων και κτιρίων µε σύστηµα τοιχωµάτων ισοδύναµο προς πλαισιωτό, η ακόλουθη συνθήκη πρέπει να ικανοποιείται σε όλους τους κόµβους µεταξύ βασικών ή δευτερευουσών σεισµικών δοκών και βασικών σεισµικών υποστυλωµάτων:**')
      st.markdown(r'''
       $$\sum M_{Rc} \geq 1.3 \sum M_{Rb}$$
       ''')
      st.info('Η αυστηρή ερµηνεία της συνθήκης απαιτεί τον υπολογισµό των ροπών στο κέντρο του κόµβου. Οι ροπές αυτές αντιστοιχούν στην ανάπτυξη των τιµών σχεδιασµού των ροπών αντοχής των υποστυλωµάτων ή των δοκών στις εξωτερικές παρειές του κόµβου, καθώς και κατάλληλη πρόβλεψη για τις ροπές που οφείλονται στις τέµνουσες δυνάµεις των παρειών του κόµβου. Εντούτοις, η απώλεια στην ακρίβεια είναι µικρή και η απλοποίηση είναι σηµαντική εάν αγνοηθεί η επίδραση των τεµνουσών. Εποµένως η προσέγγιση αυτή θεωρείται τότε αποδεκτή.', icon="ℹ️️")
with tab4:
    st.write('_Το άθροισµα των τιµών σχεδιασµού των ροπών αντοχής των δοκών που συνδέονται µονολιθικά στον κόµβο._')

st.write("")
st.subheader("ΕΛΕΓΧΟΣ ΑΝΙΣΟΤΗΤΑΣ")
st.write("Για να ελέγξουμε την **ισσοροπία του κόμβου** θα πρέπει να συγκρίνουμε τις συνολικές ροπές των υποστυλωμάτων και των δοκών που υπολογίσαμε πιο πάνω. Η σύγκριση αυτή γίνεται μέσω της ανισότητας:")
st.markdown(r'''
  $$\sum_{ΜRc} \geq 1.3 \sum_{ΜRb}$$

  όπου εάν **δεν ικανοποίειται** συμαίνει ότι **θα πρέπει να γίνει ενίσχυση του κόμβου ή να επαναεξεταστεί ο σχεδιασμός.**
  ''')


















